betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
/* SPDX-License-Identifier: LicenseRef-FNCL-1.1
 * Copyright (c) 2026 Cpt_Kirk
 */
#include "ha/ha_cover_fetcher.h"

#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/idf_additions.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "esp_crt_bundle.h"
#include "esp_http_client.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"

#include "soc/soc_caps.h"

#include "app_config.h"
#include "miniz.h"

/* JPEG backend selection ---------------------------------------------------
 * - ESP32-P4 has a hardware JPEG codec. We use the IDF `driver/jpeg_decode`
 *   API for fast zero-copy RGB565 output.
 * - All other targets (e.g. ESP32-S3 / panels3) fall back to the ROM-resident
 *   TJpgDec software decoder. It is single-threaded, runs at low priority on
 *   core 1, and outputs RGB888 which we convert to RGB565 in the output
 *   callback. Sufficient for ~1 cover/sec at typical HA sizes. */
#if SOC_JPEG_DECODE_SUPPORTED
#include "driver/jpeg_decode.h"
#else
#include "rom/tjpgd.h"
#endif

#include "ha/ha_client.h"

#if LV_USE_LODEPNG
#include "../../managed_components/lvgl__lvgl/src/libs/lodepng/lodepng.h"
#endif

#define TAG "ha_cover"

#define COVER_Q_DEPTH 4
#define COVER_MAX_DOWNLOAD 1024 * 1024  /* 1 MiB upper bound per cover JPG */
#define COVER_GATE_POLL_MS 120
#define COVER_MIN_W 16
#define COVER_MIN_H 16
#define COVER_HTTP_WAIT_LOG_MS 5000
#if defined(CONFIG_APP_PANEL_VARIANT_S3_480)
#define COVER_HTTP_MIN_INTERNAL_FREE_BYTES (12U * 1024U)
#define COVER_HTTP_MIN_INTERNAL_LARGEST_BYTES (8U * 1024U)
#define COVER_HTTP_PRESSURE_HOLD_MS 2000
#define COVER_HTTP_MAX_ATTEMPTS 6
#define COVER_HTTP_RETRY_DELAY_MS 2500
#define COVER_HTTP_BUFFER_SIZE 512
#define COVER_HTTP_TX_BUFFER_SIZE 768
#define COVER_HTTP_READ_CHUNK 512
#define COVER_SINK_INITIAL_CAP (8U * 1024U)
#else
#define COVER_HTTP_MIN_INTERNAL_FREE_BYTES (14U * 1024U)
#define COVER_HTTP_MIN_INTERNAL_LARGEST_BYTES (8U * 1024U)
#define COVER_HTTP_PRESSURE_HOLD_MS 1000
#define COVER_HTTP_MAX_ATTEMPTS 3
#define COVER_HTTP_RETRY_DELAY_MS 1000
#define COVER_HTTP_BUFFER_SIZE 1024
#define COVER_HTTP_TX_BUFFER_SIZE 1024
#define COVER_HTTP_READ_CHUNK 1024
#define COVER_SINK_INITIAL_CAP (32U * 1024U)
#endif

typedef struct {
    char url[512];         /* proxy path or absolute URL */
    int target_w;
    int target_h;
    ha_cover_cb_t cb;
    void *user;
} cover_req_t;

typedef struct {
    ha_cover_result_t result;
    ha_cover_cb_t cb;
    void *user;
} cover_dispatch_t;

static QueueHandle_t s_queue = NULL;
static TaskHandle_t s_task = NULL;
static SemaphoreHandle_t s_lock = NULL;
#if SOC_JPEG_DECODE_SUPPORTED
static jpeg_decoder_handle_t s_decoder = NULL;
#endif
static void *s_cancelled_user = NULL; /* serialised via s_lock with the worker */
static cover_req_t s_inflight = {0};  /* guarded by s_lock                    */
static bool s_inflight_valid = false;

static void cover_dispatch_on_lvgl(void *data);

/* ---- HTTP download into a heap buffer ---- */

typedef struct {
    uint8_t *buf;
    size_t len;
    size_t cap;
    bool truncated;
} http_sink_t;

typedef struct {
    ha_client_http_ctx_t ctx;
    char full_url[640];
    char auth[600];
} cover_http_work_t;

static void *cover_heap_calloc(size_t count, size_t size)
{
#if defined(CONFIG_SPIRAM)
    void *ptr = heap_caps_calloc(count, size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (ptr != NULL) {
        return ptr;
    }
#endif
    return heap_caps_calloc(count, size, MALLOC_CAP_8BIT);
}

static bool cover_request_cancelled_locked(void *user)
{
    return (s_cancelled_user != NULL && s_cancelled_user == user);
}

static bool cover_wait_until_http_ready(void *user)
{
    int64_t last_log_ms = 0;
    for (;;) {
        ha_client_set_aux_http_pressure(true, COVER_HTTP_PRESSURE_HOLD_MS);
        bool connected = ha_client_is_connected();
        bool heavy_busy = ha_client_heavy_gate_is_busy();
        size_t free_internal = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
        size_t largest_internal = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL);
        bool heap_ok = (free_internal >= COVER_HTTP_MIN_INTERNAL_FREE_BYTES) &&
                       (largest_internal >= COVER_HTTP_MIN_INTERNAL_LARGEST_BYTES);

        if (connected && !heavy_busy && heap_ok) {
            return true;
        }

        int64_t now_ms = esp_timer_get_time() / 1000;
        if ((now_ms - last_log_ms) >= COVER_HTTP_WAIT_LOG_MS) {
            last_log_ms = now_ms;
            ESP_LOGI(TAG,
                "Cover HTTP waiting: connected=%d heavy=%d free_internal=%u largest=%u",
                connected ? 1 : 0,
                heavy_busy ? 1 : 0,
                (unsigned)free_internal,
                (unsigned)largest_internal);
        }

        vTaskDelay(pdMS_TO_TICKS(COVER_GATE_POLL_MS));
        xSemaphoreTake(s_lock, portMAX_DELAY);
        bool cancel_now = cover_request_cancelled_locked(user);
        xSemaphoreGive(s_lock);
        if (cancel_now) {
            ha_client_set_aux_http_pressure(false, 0);
            return false;
        }
    }
}

static bool cover_delay_or_cancel(void *user, uint32_t delay_ms)
{
    uint32_t elapsed_ms = 0;
    while (elapsed_ms < delay_ms) {
        uint32_t step_ms = delay_ms - elapsed_ms;
        if (step_ms > COVER_GATE_POLL_MS) {
            step_ms = COVER_GATE_POLL_MS;
        }
        vTaskDelay(pdMS_TO_TICKS(step_ms));
        elapsed_ms += step_ms;

        xSemaphoreTake(s_lock, portMAX_DELAY);
        bool cancel_now = cover_request_cancelled_locked(user);
        xSemaphoreGive(s_lock);
        if (cancel_now) {
            return false;
        }
    }
    return true;
}

static bool cover_is_png(const uint8_t *buf, size_t len)
{
    static const uint8_t magic[8] = {0x89, 0x50, 0x4E, 0x47, 0x0D, 0x0A, 0x1A, 0x0A};
    return buf != NULL && len >= sizeof(magic) && memcmp(buf, magic, sizeof(magic)) == 0;
}

static uint32_t cover_png_read_be32(const uint8_t *buf)
{
    return ((uint32_t)buf[0] << 24) | ((uint32_t)buf[1] << 16) |
           ((uint32_t)buf[2] << 8) | (uint32_t)buf[3];
}

static bool cover_png_get_header(const uint8_t *buf, size_t len,
                                 uint32_t *out_w, uint32_t *out_h,
                                 uint8_t *out_bit_depth, uint8_t *out_color_type,
                                 uint8_t *out_interlace)
{
    if (!cover_is_png(buf, len) || out_w == NULL || out_h == NULL || len < 29) {
        return false;
    }

    if (memcmp(buf + 12, "IHDR", 4) != 0) {
        return false;
    }

    *out_w = cover_png_read_be32(buf + 16);
    *out_h = cover_png_read_be32(buf + 20);
    if (out_bit_depth != NULL) {
        *out_bit_depth = buf[24];
    }
    if (out_color_type != NULL) {
        *out_color_type = buf[25];
    }
    if (out_interlace != NULL) {
        *out_interlace = buf[28];
    }
    return *out_w > 0 && *out_h > 0;
}

static void cover_png_free_decoded(void *ptr)
{
    if (ptr == NULL) {
        return;
    }
#if defined(CONFIG_SPIRAM)
    heap_caps_free(ptr);
#else
    lv_free(ptr);
#endif
}

static bool cover_png_collect_idat(const uint8_t *png, size_t len, uint8_t **out_idat, size_t *out_len)
{
    if (png == NULL || out_idat == NULL || out_len == NULL || !cover_is_png(png, len)) {
        return false;
    }

    uint8_t *idat = NULL;
    size_t idat_len = 0;
    size_t pos = 8;
    while (pos + 12 <= len) {
        uint32_t chunk_len = cover_png_read_be32(png + pos);
        size_t chunk_total = (size_t)chunk_len + 12U;
        if (pos + chunk_total > len || pos + chunk_total < pos) {
            cover_png_free_decoded(idat);
            return false;
        }

