betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
        const uint8_t *chunk_type = png + pos + 4;
        const uint8_t *chunk_data = png + pos + 8;
        if (memcmp(chunk_type, "IDAT", 4) == 0) {
            size_t new_len = idat_len + chunk_len;
            uint8_t *grown = heap_caps_realloc(idat, new_len, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
            if (grown == NULL) {
                cover_png_free_decoded(idat);
                return false;
            }
            idat = grown;
            memcpy(idat + idat_len, chunk_data, chunk_len);
            idat_len = new_len;
        } else if (memcmp(chunk_type, "IEND", 4) == 0) {
            break;
        }

        pos += chunk_total;
    }

    if (idat == NULL || idat_len == 0) {
        cover_png_free_decoded(idat);
        return false;
    }

    *out_idat = idat;
    *out_len = idat_len;
    return true;
}

static void cover_pick_png_output_size(uint32_t src_w, uint32_t src_h,
                                       int target_w, int target_h,
                                       uint32_t *out_w, uint32_t *out_h)
{
    if (out_w == NULL || out_h == NULL || src_w == 0 || src_h == 0) {
        return;
    }

    if (target_w <= 0 || target_h <= 0) {
        *out_w = src_w;
        *out_h = src_h;
        return;
    }

    uint32_t dst_w = (uint32_t)target_w;
    uint32_t dst_h = (uint32_t)(((uint64_t)src_h * dst_w) / src_w);
    if (dst_h == 0) {
        dst_h = 1;
    }

    if (dst_h > (uint32_t)target_h) {
        dst_h = (uint32_t)target_h;
        dst_w = (uint32_t)(((uint64_t)src_w * dst_h) / src_h);
        if (dst_w == 0) {
            dst_w = 1;
        }
    }

    if (dst_w > src_w) {
        dst_w = src_w;
    }
    if (dst_h > src_h) {
        dst_h = src_h;
    }

    *out_w = dst_w > 0 ? dst_w : 1;
    *out_h = dst_h > 0 ? dst_h : 1;
}

static bool cover_rgb24_is_transparent_bg(uint8_t red, uint8_t green, uint8_t blue)
{
    return red <= 2U && green <= 2U && blue <= 2U;
}

static void cover_scale_rgb24_to_rgb565a8_nearest(const uint8_t *src_rgb,
                                                  uint32_t src_w, uint32_t src_h,
                                                  uint8_t *dst_color, uint8_t *dst_alpha,
                                                  uint32_t dst_w, uint32_t dst_h,
                                                  uint32_t color_stride, uint32_t alpha_stride)
{
    if (src_rgb == NULL || dst_color == NULL || dst_alpha == NULL ||
        src_w == 0 || src_h == 0 || dst_w == 0 || dst_h == 0) {
        return;
    }

    for (uint32_t y = 0; y < dst_h; y++) {
        uint32_t src_y = (uint32_t)(((uint64_t)y * src_h) / dst_h);
        if (src_y >= src_h) {
            src_y = src_h - 1U;
        }
        const uint8_t *src_row = src_rgb + ((size_t)src_y * src_w * 3U);
        uint8_t *dst_color_row = dst_color + ((size_t)y * color_stride);
        uint8_t *dst_alpha_row = dst_alpha + ((size_t)y * alpha_stride);
        for (uint32_t x = 0; x < dst_w; x++) {
            uint32_t src_x = (uint32_t)(((uint64_t)x * src_w) / dst_w);
            if (src_x >= src_w) {
                src_x = src_w - 1U;
            }
            const uint8_t *px = src_row + (src_x * 3U);
            uint8_t red = px[0];
            uint8_t green = px[1];
            uint8_t blue = px[2];
            uint16_t rgb565 = (uint16_t)(((uint16_t)(red & 0xF8U) << 8) |
                                         ((uint16_t)(green & 0xFCU) << 3) |
                                         ((uint16_t)blue >> 3));

            dst_color_row[x * 2U] = (uint8_t)(rgb565 & 0xFFU);
            dst_color_row[x * 2U + 1U] = (uint8_t)(rgb565 >> 8);
            dst_alpha_row[x] = cover_rgb24_is_transparent_bg(red, green, blue) ? 0U : 0xFFU;
        }
    }
}

static uint32_t cover_dominant_from_rgb24(const uint8_t *buf, uint32_t w, uint32_t h)
{
    if (buf == NULL || w == 0 || h == 0) {
        return 0;
    }

    uint64_t r_acc = 0;
    uint64_t g_acc = 0;
    uint64_t b_acc = 0;
    uint32_t samples = 0;
    uint32_t step_x = w > 96 ? w / 48U : 2U;
    uint32_t step_y = h > 96 ? h / 48U : 2U;
    if (step_x == 0) step_x = 1;
    if (step_y == 0) step_y = 1;

    for (uint32_t y = 0; y < h; y += step_y) {
        for (uint32_t x = 0; x < w; x += step_x) {
            const uint8_t *px = buf + (((size_t)y * w + x) * 3U);
            uint8_t red = px[0];
            uint8_t green = px[1];
            uint8_t blue = px[2];
            if (cover_rgb24_is_transparent_bg(red, green, blue)) {
                continue;
            }

            uint16_t lum = (uint16_t)red + (uint16_t)green + (uint16_t)blue;
            if (lum < 18 || lum > 720) {
                continue;
            }

            r_acc += red;
            g_acc += green;
            b_acc += blue;
            samples++;
        }
    }

    if (samples == 0) {
        return 0;
    }

    return (((uint32_t)(r_acc / samples)) << 16) |
           (((uint32_t)(g_acc / samples)) << 8) |
           ((uint32_t)(b_acc / samples));
}

static uint8_t cover_png_paeth(uint8_t a, uint8_t b, uint8_t c)
{
    int p = (int)a + (int)b - (int)c;
    int pa = abs(p - (int)a);
    int pb = abs(p - (int)b);
    int pc = abs(p - (int)c);
    if (pa <= pb && pa <= pc) {
        return a;
    }
    if (pb <= pc) {
        return b;
    }
    return c;
}

static bool cover_unfilter_rgba8_row(uint8_t *dst, const uint8_t *src, const uint8_t *prev, size_t rowbytes, uint8_t filter)
{
    if (dst == NULL || src == NULL || rowbytes == 0) {
        return false;
    }

    const size_t bytewidth = 4U;
    switch (filter) {
        case 0:
            memcpy(dst, src, rowbytes);
            return true;
        case 1:
            for (size_t i = 0; i < rowbytes; i++) {
                uint8_t left = i >= bytewidth ? dst[i - bytewidth] : 0U;
                dst[i] = (uint8_t)(src[i] + left);
            }
            return true;
        case 2:
            for (size_t i = 0; i < rowbytes; i++) {
                uint8_t up = prev != NULL ? prev[i] : 0U;
                dst[i] = (uint8_t)(src[i] + up);
            }
            return true;
        case 3:
            for (size_t i = 0; i < rowbytes; i++) {
                uint8_t left = i >= bytewidth ? dst[i - bytewidth] : 0U;
                uint8_t up = prev != NULL ? prev[i] : 0U;
                dst[i] = (uint8_t)(src[i] + (uint8_t)(((uint16_t)left + (uint16_t)up) / 2U));
            }
            return true;
        case 4:
            for (size_t i = 0; i < rowbytes; i++) {
                uint8_t left = i >= bytewidth ? dst[i - bytewidth] : 0U;
                uint8_t up = prev != NULL ? prev[i] : 0U;
                uint8_t up_left = (prev != NULL && i >= bytewidth) ? prev[i - bytewidth] : 0U;
                dst[i] = (uint8_t)(src[i] + cover_png_paeth(left, up, up_left));
            }
            return true;
        default:
            return false;
    }
}

static void cover_scale_rgba8_row_to_rgb565a8(const uint8_t *src_row, uint32_t src_w,
                                              uint8_t *dst_color_row, uint8_t *dst_alpha_row,
                                              uint32_t dst_w)
{
    if (src_row == NULL || dst_color_row == NULL || dst_alpha_row == NULL || src_w == 0 || dst_w == 0) {
        return;
    }

    for (uint32_t x = 0; x < dst_w; x++) {
        uint32_t src_x = (uint32_t)(((uint64_t)x * src_w) / dst_w);
        if (src_x >= src_w) {
            src_x = src_w - 1U;
        }
        const uint8_t *px = src_row + ((size_t)src_x * 4U);
        uint8_t red = px[0];
        uint8_t green = px[1];
        uint8_t blue = px[2];
        uint16_t rgb565 = (uint16_t)(((uint16_t)(red & 0xF8U) << 8) |
                                     ((uint16_t)(green & 0xFCU) << 3) |
                                     ((uint16_t)blue >> 3));
        dst_color_row[x * 2U] = (uint8_t)(rgb565 & 0xFFU);
        dst_color_row[x * 2U + 1U] = (uint8_t)(rgb565 >> 8);
        dst_alpha_row[x] = px[3];
    }
}

