betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
typedef struct {
    uint32_t src_w;
    uint32_t src_h;
    uint32_t out_w;
    uint32_t out_h;
    uint32_t color_stride;
    uint32_t alpha_stride;
    uint32_t next_dst_y;
    uint32_t src_y;
    uint32_t step_x;
    uint32_t step_y;
    uint32_t samples;
    uint64_t r_acc;
    uint64_t g_acc;
    uint64_t b_acc;
    uint8_t *line;
    size_t line_size;
    size_t line_len;
    uint8_t *prev_row;
    uint8_t *curr_row;
    uint8_t *rgb565a8;
    uint8_t *alpha_plane;
    size_t rowbytes;
    size_t expected_size;
    size_t emitted;
    bool failed;
} cover_png_stream_ctx_t;

static void cover_accumulate_dominant_rgba8_row(const uint8_t *row, uint32_t src_w, uint32_t src_y,
                                                uint32_t step_x, uint32_t step_y,
                                                uint64_t *r_acc, uint64_t *g_acc, uint64_t *b_acc,
                                                uint32_t *samples)
{
    if (row == NULL || src_w == 0 || r_acc == NULL || g_acc == NULL || b_acc == NULL || samples == NULL) {
        return;
    }
    if (step_y == 0 || (src_y % step_y) != 0) {
        return;
    }

    for (uint32_t x = 0; x < src_w; x += step_x) {
        const uint8_t *px = row + ((size_t)x * 4U);
        uint8_t red = px[0];
        uint8_t green = px[1];
        uint8_t blue = px[2];
        uint8_t alpha = px[3];
        if (alpha < 24U) {
            continue;
        }

        uint16_t lum = (uint16_t)red + (uint16_t)green + (uint16_t)blue;
        if (lum < 18U || lum > 720U) {
            continue;
        }

        *r_acc += red;
        *g_acc += green;
        *b_acc += blue;
        (*samples)++;
    }
}

static bool cover_png_process_streamed_row(cover_png_stream_ctx_t *ctx)
{
    if (ctx == NULL || ctx->line == NULL || ctx->curr_row == NULL || ctx->src_y >= ctx->src_h) {
        return false;
    }

    if (!cover_unfilter_rgba8_row(ctx->curr_row, ctx->line + 1U,
                                  ctx->src_y > 0 ? ctx->prev_row : NULL,
                                  ctx->rowbytes, ctx->line[0])) {
        ESP_LOGW(TAG, "png unsupported filter %u", ctx->line[0]);
        return false;
    }

    cover_accumulate_dominant_rgba8_row(ctx->curr_row, ctx->src_w, ctx->src_y,
                                        ctx->step_x, ctx->step_y,
                                        &ctx->r_acc, &ctx->g_acc, &ctx->b_acc,
                                        &ctx->samples);

    while (ctx->next_dst_y < ctx->out_h &&
           (uint32_t)(((uint64_t)ctx->next_dst_y * ctx->src_h) / ctx->out_h) == ctx->src_y) {
        uint8_t *dst_color_row = ctx->rgb565a8 + ((size_t)ctx->next_dst_y * ctx->color_stride);
        uint8_t *dst_alpha_row = ctx->alpha_plane + ((size_t)ctx->next_dst_y * ctx->alpha_stride);
        cover_scale_rgba8_row_to_rgb565a8(ctx->curr_row, ctx->src_w, dst_color_row, dst_alpha_row, ctx->out_w);
        ctx->next_dst_y++;
    }

    uint8_t *swap = ctx->prev_row;
    ctx->prev_row = ctx->curr_row;
    ctx->curr_row = swap;
    ctx->src_y++;
    ctx->line_len = 0;
    return true;
}

static int cover_png_inflate_cb(const void *buf, int len, void *user)
{
    cover_png_stream_ctx_t *ctx = (cover_png_stream_ctx_t *)user;
    if (ctx == NULL || buf == NULL || len < 0 || ctx->line == NULL) {
        return 0;
    }

    const uint8_t *src = (const uint8_t *)buf;
    size_t remaining = (size_t)len;
    while (remaining > 0) {
        if (ctx->emitted >= ctx->expected_size) {
            ctx->failed = true;
            return 0;
        }

        size_t line_space = ctx->line_size - ctx->line_len;
        size_t expected_left = ctx->expected_size - ctx->emitted;
        size_t take = remaining;
        if (take > line_space) {
            take = line_space;
        }
        if (take > expected_left) {
            take = expected_left;
        }
        if (take == 0) {
            ctx->failed = true;
            return 0;
        }

        memcpy(ctx->line + ctx->line_len, src, take);
        ctx->line_len += take;
        ctx->emitted += take;
        src += take;
        remaining -= take;

        if (ctx->line_len == ctx->line_size) {
            if (!cover_png_process_streamed_row(ctx)) {
                ctx->failed = true;
                return 0;
            }
        }
    }

    return 1;
}

static bool cover_png_inflate_stream_lowlevel(const uint8_t *idat, size_t idat_len,
                                              cover_png_stream_ctx_t *stream,
                                              size_t *consumed_out,
                                              tinfl_status *status_out)
{
    if (idat == NULL || idat_len == 0 || stream == NULL) {
        if (consumed_out != NULL) *consumed_out = 0;
        if (status_out != NULL) *status_out = TINFL_STATUS_BAD_PARAM;
        return false;
    }

    tinfl_decompressor *decomp = (tinfl_decompressor *)heap_caps_calloc(
        1, sizeof(tinfl_decompressor), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    uint8_t *dict = (uint8_t *)heap_caps_malloc(
        TINFL_LZ_DICT_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (decomp == NULL) {
        decomp = (tinfl_decompressor *)heap_caps_calloc(
            1, sizeof(tinfl_decompressor), MALLOC_CAP_8BIT);
    }
    if (dict == NULL) {
        dict = (uint8_t *)heap_caps_malloc(TINFL_LZ_DICT_SIZE, MALLOC_CAP_8BIT);
    }
    if (decomp == NULL || dict == NULL) {
        ESP_LOGW(TAG, "png inflate alloc failed: decomp=%p dict=%p psram_free=%u psram_largest=%u",
                 decomp, dict,
                 (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT),
                 (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
        heap_caps_free(decomp);
        heap_caps_free(dict);
        if (consumed_out != NULL) *consumed_out = 0;
        if (status_out != NULL) *status_out = TINFL_STATUS_BAD_PARAM;
        return false;
    }

    tinfl_init(decomp);
    size_t in_ofs = 0;
    size_t dict_ofs = 0;
    tinfl_status status = TINFL_STATUS_FAILED;
    bool ok = false;

