betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
    for (;;) {
        size_t in_size = idat_len - in_ofs;
        size_t out_size = (size_t)TINFL_LZ_DICT_SIZE - dict_ofs;
        status = tinfl_decompress(decomp,
                                  idat + in_ofs,
                                  &in_size,
                                  dict,
                                  dict + dict_ofs,
                                  &out_size,
                                  TINFL_FLAG_PARSE_ZLIB_HEADER);
        in_ofs += in_size;

        if (out_size > 0) {
            if (!cover_png_inflate_cb(dict + dict_ofs, (int)out_size, stream)) {
                status = TINFL_STATUS_FAILED;
                break;
            }
            dict_ofs = (dict_ofs + out_size) & ((size_t)TINFL_LZ_DICT_SIZE - 1U);
        }

        if (status == TINFL_STATUS_DONE) {
            ok = true;
            break;
        }
        if (status < TINFL_STATUS_DONE) {
            break;
        }
        if (status == TINFL_STATUS_NEEDS_MORE_INPUT && in_ofs >= idat_len) {
            status = TINFL_STATUS_FAILED;
            break;
        }
        if (in_size == 0 && out_size == 0) {
            status = TINFL_STATUS_FAILED;
            break;
        }
    }

    if (consumed_out != NULL) *consumed_out = in_ofs;
    if (status_out != NULL) *status_out = status;
    heap_caps_free(decomp);
    heap_caps_free(dict);
    return ok;
}

static bool cover_decode_png_rgba8_streamed(const uint8_t *png, size_t len,
                                            uint32_t src_w, uint32_t src_h,
                                            int target_w, int target_h,
                                            ha_cover_result_t *out)
{
    if (png == NULL || len == 0 || src_w == 0 || src_h == 0 || out == NULL) {
        return false;
    }

    bool ok = false;
    uint8_t *idat = NULL;
    uint8_t *prev_row = NULL;
    uint8_t *curr_row = NULL;
    uint8_t *line = NULL;
    uint8_t *rgb565a8 = NULL;
    size_t idat_len = 0;
    size_t rowbytes = (size_t)src_w * 4U;
    size_t expected_size = ((size_t)src_w * 4U + 1U) * src_h;
    uint32_t out_w = 0;
    uint32_t out_h = 0;
    uint32_t color_stride = 0;
    uint32_t alpha_stride = 0;
    uint64_t r_acc = 0;
    uint64_t g_acc = 0;
    uint64_t b_acc = 0;
    uint32_t samples = 0;
    uint32_t step_x = src_w > 96 ? src_w / 48U : 2U;
    uint32_t step_y = src_h > 96 ? src_h / 48U : 2U;
    if (step_x == 0) step_x = 1;
    if (step_y == 0) step_y = 1;

    if (!cover_png_collect_idat(png, len, &idat, &idat_len)) {
        ESP_LOGW(TAG, "png IDAT collect failed");
        goto cleanup;
    }

    line = heap_caps_malloc(rowbytes + 1U, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    prev_row = heap_caps_malloc(rowbytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    curr_row = heap_caps_malloc(rowbytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (line == NULL || prev_row == NULL || curr_row == NULL) {
        ESP_LOGW(TAG, "png row alloc failed: row=%u line=%u psram_free=%u psram_largest=%u",
                 (unsigned)rowbytes,
                 (unsigned)(rowbytes + 1U),
                 (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT),
                 (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
        goto cleanup;
    }
    memset(prev_row, 0, rowbytes);
    memset(curr_row, 0, rowbytes);
    memset(line, 0, rowbytes + 1U);

    cover_pick_png_output_size(src_w, src_h, target_w, target_h, &out_w, &out_h);
    color_stride = lv_draw_buf_width_to_stride(out_w, LV_COLOR_FORMAT_RGB565A8);
    alpha_stride = color_stride / 2U;
    size_t out_size = (size_t)color_stride * out_h + (size_t)alpha_stride * out_h;
    rgb565a8 = heap_caps_malloc(out_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (rgb565a8 == NULL) {
        ESP_LOGW(TAG, "png alloc %u bytes failed", (unsigned)out_size);
        goto cleanup;
    }
    memset(rgb565a8, 0, out_size);

    uint8_t *alpha_plane = rgb565a8 + ((size_t)color_stride * out_h);
    cover_png_stream_ctx_t stream = {
        .src_w = src_w,
        .src_h = src_h,
        .out_w = out_w,
        .out_h = out_h,
        .color_stride = color_stride,
        .alpha_stride = alpha_stride,
        .step_x = step_x,
        .step_y = step_y,
        .line = line,
        .line_size = rowbytes + 1U,
        .prev_row = prev_row,
        .curr_row = curr_row,
        .rgb565a8 = rgb565a8,
        .alpha_plane = alpha_plane,
        .rowbytes = rowbytes,
        .expected_size = expected_size,
    };

    ESP_LOGI(TAG, "png stream: src=%ux%u out=%ux%u idat=%u raw=%u",
             (unsigned)src_w, (unsigned)src_h,
             (unsigned)out_w, (unsigned)out_h,
             (unsigned)idat_len, (unsigned)expected_size);

    size_t consumed = 0;
    tinfl_status inflate_status = TINFL_STATUS_FAILED;
    bool inflate_ok = cover_png_inflate_stream_lowlevel(idat, idat_len, &stream,
                                                        &consumed, &inflate_status);
    if (!inflate_ok || stream.failed || stream.emitted != expected_size ||
        stream.src_y != src_h || stream.line_len != 0) {
        ESP_LOGW(TAG,
                 "png zlib stream failed: ok=%d status=%d failed=%d consumed=%u/%u emitted=%u/%u row=%u/%u line=%u psram_free=%u psram_largest=%u",
                 inflate_ok ? 1 : 0, (int)inflate_status, (int)stream.failed,
                 (unsigned)consumed, (unsigned)idat_len,
                 (unsigned)stream.emitted, (unsigned)expected_size,
                 (unsigned)stream.src_y, (unsigned)src_h,
                 (unsigned)stream.line_len,
                 (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT),
                 (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
        goto cleanup;
    }

    while (stream.next_dst_y < out_h) {
        uint8_t *dst_color_row = rgb565a8 + ((size_t)stream.next_dst_y * color_stride);
        uint8_t *dst_alpha_row = alpha_plane + ((size_t)stream.next_dst_y * alpha_stride);
        cover_scale_rgba8_row_to_rgb565a8(stream.prev_row, src_w, dst_color_row, dst_alpha_row, out_w);
        stream.next_dst_y++;
    }

    out->image.header.magic = LV_IMAGE_HEADER_MAGIC;
    out->image.header.cf = LV_COLOR_FORMAT_RGB565A8;
    out->image.header.flags = 0;
    out->image.header.w = out_w;
    out->image.header.h = out_h;
    out->image.header.stride = color_stride;
    out->image.data_size = (size_t)color_stride * out_h + (size_t)alpha_stride * out_h;
    out->image.data = rgb565a8;
    out->source_w = src_w;
    out->source_h = src_h;
    samples = stream.samples;
    r_acc = stream.r_acc;
    g_acc = stream.g_acc;
    b_acc = stream.b_acc;
    out->dominant_rgb = samples > 0
                            ? ((((uint32_t)(r_acc / samples)) << 16) |
                               (((uint32_t)(g_acc / samples)) << 8) |
                               ((uint32_t)(b_acc / samples)))
                            : 0;
    out->valid = true;
    rgb565a8 = NULL;
    ok = true;

cleanup:
    cover_png_free_decoded(idat);
    cover_png_free_decoded(line);
    cover_png_free_decoded(prev_row);
    cover_png_free_decoded(curr_row);
    cover_png_free_decoded(rgb565a8);
    return ok;
}

static bool cover_decode_png(const uint8_t *png, size_t len, int target_w, int target_h,
                             ha_cover_result_t *out)
{
#if !LV_USE_LODEPNG
    LV_UNUSED(png);
    LV_UNUSED(len);
    LV_UNUSED(target_w);
    LV_UNUSED(target_h);
    LV_UNUSED(out);
    ESP_LOGW(TAG, "png fetched but LV_USE_LODEPNG is disabled");
    return false;
#else
    if (png == NULL || len == 0 || out == NULL) {
        return false;
    }

    uint32_t src_w = 0;
    uint32_t src_h = 0;
    uint8_t bit_depth = 0;
    uint8_t color_type = 0;
    uint8_t interlace = 0;
    if (!cover_png_get_header(png, len, &src_w, &src_h, &bit_depth, &color_type, &interlace)) {
        ESP_LOGW(TAG, "png header parse failed");
        return false;
    }

    /* Roborock maps currently arrive as non-interlaced RGBA8 PNGs. Decode them
     * through a scanline path so we never materialize the full RGBA image in RAM. */
    if (bit_depth == 8U && color_type == 6U && interlace == 0U) {
        return cover_decode_png_rgba8_streamed(png, len, src_w, src_h, target_w, target_h, out);
    }

    uint8_t *decoded = NULL;
    unsigned decoded_w = 0;
    unsigned decoded_h = 0;
    unsigned err = lodepng_decode24(&decoded, &decoded_w, &decoded_h, png, len);
    if (err != 0 || decoded == NULL || decoded_w == 0 || decoded_h == 0) {
        if (decoded != NULL) {
            cover_png_free_decoded(decoded);
        }
        ESP_LOGW(TAG, "png decode failed: %u (%s)", err, lodepng_error_text(err));
        return false;
    }

