betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
    uint32_t out_w = 0;
    uint32_t out_h = 0;
    cover_pick_png_output_size(decoded_w, decoded_h, target_w, target_h, &out_w, &out_h);
    uint32_t color_stride = lv_draw_buf_width_to_stride(out_w, LV_COLOR_FORMAT_RGB565A8);
    uint32_t alpha_stride = color_stride / 2U;
    size_t out_size = (size_t)color_stride * out_h + (size_t)alpha_stride * out_h;
    uint8_t *rgb565a8 = heap_caps_malloc(out_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (rgb565a8 == NULL) {
        cover_png_free_decoded(decoded);
        ESP_LOGW(TAG, "png alloc %u bytes failed", (unsigned)out_size);
        return false;
    }
    memset(rgb565a8, 0, out_size);

    uint8_t *alpha_plane = rgb565a8 + ((size_t)color_stride * out_h);
    cover_scale_rgb24_to_rgb565a8_nearest(decoded, decoded_w, decoded_h,
                                          rgb565a8, alpha_plane,
                                          out_w, out_h,
                                          color_stride, alpha_stride);

    out->image.header.magic = LV_IMAGE_HEADER_MAGIC;
    out->image.header.cf = LV_COLOR_FORMAT_RGB565A8;
    out->image.header.flags = 0;
    out->image.header.w = out_w;
    out->image.header.h = out_h;
    out->image.header.stride = color_stride;
    out->image.data_size = out_size;
    out->image.data = rgb565a8;
    out->source_w = decoded_w;
    out->source_h = decoded_h;
    out->dominant_rgb = cover_dominant_from_rgb24(decoded, decoded_w, decoded_h);
    cover_png_free_decoded(decoded);
    out->valid = true;
    return true;
#endif
}

static esp_err_t cover_sink_append(http_sink_t *sink, const uint8_t *data, size_t len)
{
    if (sink == NULL || data == NULL || len == 0 || sink->truncated) {
        return ESP_OK;
    }

    size_t needed = sink->len + len;
    if (needed > COVER_MAX_DOWNLOAD) {
        sink->truncated = true;
        return ESP_ERR_INVALID_SIZE;
    }
    if (needed > sink->cap) {
        size_t new_cap = sink->cap ? sink->cap * 2 : COVER_SINK_INITIAL_CAP;
        while (new_cap < needed) new_cap *= 2;
        if (new_cap > COVER_MAX_DOWNLOAD) new_cap = COVER_MAX_DOWNLOAD;
        uint8_t *resized = heap_caps_realloc(sink->buf, new_cap, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        if (resized == NULL) {
            sink->truncated = true;
            return ESP_ERR_NO_MEM;
        }
        sink->buf = resized;
        sink->cap = new_cap;
    }
    memcpy(sink->buf + sink->len, data, len);
    sink->len += len;
    return ESP_OK;
}

static const char *cover_url_kind(const char *url)
{
    if (url == NULL) {
        return "unknown";
    }
    if (strstr(url, "media_player_proxy") != NULL) {
        return "media";
    }
    if (strstr(url, "image_proxy") != NULL) {
        return "image";
    }
    if (strstr(url, "camera_proxy") != NULL) {
        return "camera";
    }
    return "cover";
}

static const char *cover_header_or_dash(esp_http_client_handle_t cli, const char *key)
{
    char *value = NULL;
    if (esp_http_client_get_header(cli, key, &value) == ESP_OK && value != NULL && value[0] != '\0') {
        return value;
    }
    return "-";
}

static esp_err_t cover_download(const char *url, http_sink_t *sink)
{
    cover_http_work_t *work = (cover_http_work_t *)cover_heap_calloc(1, sizeof(*work));
    if (work == NULL) {
        ESP_LOGW(TAG, "cover http work alloc failed");
        return ESP_ERR_NO_MEM;
    }

    esp_err_t ret = ESP_FAIL;
    uint8_t *read_buf = NULL;
    if (!ha_client_get_http_context(&work->ctx)) {
        ESP_LOGW(TAG, "no HA http context yet");
        ret = ESP_ERR_INVALID_STATE;
        goto cleanup;
    }

    if (strncmp(url, "http://", 7) == 0 || strncmp(url, "https://", 8) == 0) {
        snprintf(work->full_url, sizeof(work->full_url), "%s", url);
    } else if (url[0] == '/') {
        snprintf(work->full_url, sizeof(work->full_url), "%s%s", work->ctx.base_url, url);
    } else {
        snprintf(work->full_url, sizeof(work->full_url), "%s/%s", work->ctx.base_url, url);
    }
    const char *url_kind = cover_url_kind(work->full_url);

    esp_http_client_config_t cfg = {
        .url = work->full_url,
        .method = HTTP_METHOD_GET,
        .timeout_ms = 15000,
        .buffer_size = COVER_HTTP_BUFFER_SIZE,
        .buffer_size_tx = COVER_HTTP_TX_BUFFER_SIZE,
        .keep_alive_enable = false,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
        .crt_bundle_attach = esp_crt_bundle_attach,
#endif
    };
    if (work->ctx.cert_common_name[0] != '\0') cfg.common_name = work->ctx.cert_common_name;

    esp_http_client_handle_t cli = esp_http_client_init(&cfg);
    if (cli == NULL) {
        ret = ESP_ERR_NO_MEM;
        goto cleanup;
    }

    if (work->ctx.host_header[0] != '\0') {
        esp_http_client_set_header(cli, "Host", work->ctx.host_header);
    }
    esp_http_client_set_header(cli, "Connection", "close");
    esp_http_client_set_header(cli, "Accept", "image/*");
    /* The HA media_player_proxy URLs already carry a ?token=... query; a Bearer
     * header is harmless but unnecessary and would bloat the request.  Only
     * attach it for URLs that don't include a token. */
    if (strstr(work->full_url, "token=") == NULL && work->ctx.bearer_token[0] != '\0') {
        snprintf(work->auth, sizeof(work->auth), "Bearer %s", work->ctx.bearer_token);
        esp_http_client_set_header(cli, "Authorization", work->auth);
    }

    esp_err_t err = esp_http_client_open(cli, 0);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "http open failed: %s errno=%d free_internal=%u largest=%u",
            esp_err_to_name(err),
            esp_http_client_get_errno(cli),
            (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
            (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL));
        ret = err;
        goto client_cleanup;
    }

    int64_t content_length = esp_http_client_fetch_headers(cli);
    int status = esp_http_client_get_status_code(cli);
    if (content_length < 0) {
        ESP_LOGW(TAG, "http fetch headers failed: %" PRId64, content_length);
        ret = ESP_ERR_HTTP_FETCH_HEADER;
        goto client_close;
    }
    if (status != 200) {
        ESP_LOGW(TAG, "http status=%d for cover fetch", status);
        ret = ESP_ERR_HTTP_BASE + status;
        goto client_close;
    }
    if (content_length > COVER_MAX_DOWNLOAD) {
        ESP_LOGW(TAG, "cover content-length too large: %" PRId64, content_length);
        ret = ESP_ERR_INVALID_SIZE;
        goto client_close;
    }

