betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
    ESP_LOGI(TAG,
        "Cover HTTP headers kind=%s status=%d len=%" PRId64 " type=%s transfer=%s encoding=%s conn=%s",
        url_kind,
        status,
        content_length,
        cover_header_or_dash(cli, "Content-Type"),
        cover_header_or_dash(cli, "Transfer-Encoding"),
        cover_header_or_dash(cli, "Content-Encoding"),
        cover_header_or_dash(cli, "Connection"));

    read_buf = (uint8_t *)heap_caps_malloc(COVER_HTTP_READ_CHUNK, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (read_buf == NULL) {
        read_buf = (uint8_t *)heap_caps_malloc(COVER_HTTP_READ_CHUNK, MALLOC_CAP_8BIT);
    }
    if (read_buf == NULL) {
        ESP_LOGW(TAG, "cover read buffer alloc failed (%u bytes)", (unsigned)COVER_HTTP_READ_CHUNK);
        ret = ESP_ERR_NO_MEM;
        goto client_close;
    }

    uint8_t zero_read_count = 0;
    const bool known_length = (content_length > 0);
    while (true) {
        int read_len = esp_http_client_read(cli, (char *)read_buf, COVER_HTTP_READ_CHUNK);
        if (read_len < 0) {
            int tls_code = 0;
            int tls_flags = 0;
            esp_err_t tls_err = esp_http_client_get_and_clear_last_tls_error(cli, &tls_code, &tls_flags);
            ESP_LOGW(TAG,
                "http read failed: %d kind=%s status=%d got=%u/%" PRId64
                " errno=%d tls_err=%s tls_code=0x%x tls_flags=0x%x complete=%d free_internal=%u largest=%u",
                read_len,
                url_kind,
                status,
                (unsigned)sink->len,
                content_length,
                esp_http_client_get_errno(cli),
                esp_err_to_name(tls_err),
                (unsigned)tls_code,
                (unsigned)tls_flags,
                esp_http_client_is_complete_data_received(cli) ? 1 : 0,
                (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL));
            ret = (read_len == -ESP_ERR_HTTP_EAGAIN) ? ESP_ERR_HTTP_EAGAIN : ESP_FAIL;
            goto client_close;
        }
        if (read_len == 0) {
            if (esp_http_client_is_complete_data_received(cli) ||
                (known_length && sink->len >= (size_t)content_length)) {
                break;
            }
            zero_read_count++;
            if (zero_read_count < 3) {
                vTaskDelay(pdMS_TO_TICKS(20));
                continue;
            }
            ESP_LOGW(TAG, "http incomplete data received, %u/%" PRId64 " bytes",
                (unsigned)sink->len, content_length);
            ret = ESP_ERR_HTTP_INCOMPLETE_DATA;
            goto client_close;
        }
        zero_read_count = 0;
        ret = cover_sink_append(sink, read_buf, (size_t)read_len);
        if (ret != ESP_OK) {
            goto client_close;
        }
    }

    if (sink->truncated) {
        ESP_LOGW(TAG, "cover exceeds %d bytes, truncated", COVER_MAX_DOWNLOAD);
        ret = ESP_ERR_INVALID_SIZE;
        goto client_close;
    }
    ret = (sink->len >= 64) ? ESP_OK : ESP_ERR_INVALID_RESPONSE;

client_close:
    if (read_buf != NULL) {
        heap_caps_free(read_buf);
    }
    esp_http_client_close(cli);
client_cleanup:
    esp_http_client_cleanup(cli);
cleanup:
    heap_caps_free(work);
    return ret;
}

static bool cover_download_error_is_retryable(esp_err_t err)
{
    return err == ESP_ERR_HTTP_CONNECT ||
           err == ESP_ERR_HTTP_FETCH_HEADER ||
           err == ESP_ERR_HTTP_EAGAIN ||
           err == ESP_ERR_HTTP_CONNECTION_CLOSED ||
           err == ESP_ERR_HTTP_INCOMPLETE_DATA ||
           err == ESP_ERR_TIMEOUT ||
           err == ESP_ERR_NO_MEM ||
           err == ESP_FAIL;
}

/* ---- Decode + dominant color ---- */

/* Pick sample_method that yields an output no larger than max(target_w,target_h)*1.5
 * while still keeping enough pixels for color analysis. Hardware supports 1/1, 1/2,
 * 1/4 and 1/8 scales through jpeg_down_sampling_type_t; we rely on it implicitly by
 * letting the decoder choose a sample method consistent with the picture info. */

/* Sanitize a JPEG bitstream in-place by removing unreliable optional segments
 * (COM=0xFFFE and APPn with n>=2) before the SOF marker. Some HA media sources
 * (Spotify proxy) emit COM segments with a declared length that exceeds the
 * remaining bytes, which the ESP32-P4 HW decoder rejects with "COM marker
 * data underflow". Stripping them keeps all image data intact.
 *
 * Returns the new length. Operates only between SOI and the first SOF. */
static size_t cover_jpeg_sanitize(uint8_t *buf, size_t len)
{
    if (len < 4 || buf[0] != 0xFF || buf[1] != 0xD8) return len;
    size_t rp = 2; /* read pointer, after SOI */
    size_t wp = 2; /* write pointer */
    while (rp + 3 < len) {
        if (buf[rp] != 0xFF) {
            /* Not a marker boundary — bail out, copy remainder verbatim. */
            break;
        }
        uint8_t m = buf[rp + 1];
        /* Fill bytes: 0xFF 0xFF ... */
        if (m == 0xFF) { buf[wp++] = 0xFF; rp++; continue; }
        /* Markers without payload: SOI/EOI/RSTn/TEM */
        if (m == 0xD8 || m == 0xD9 || (m >= 0xD0 && m <= 0xD7) || m == 0x01) {
            if (wp != rp) { buf[wp] = 0xFF; buf[wp + 1] = m; }
            wp += 2; rp += 2;
            continue;
        }
        /* SOF / SOS / DQT / DHT / DRI / JFIF(APP0) / Exif(APP1): keep.
         * COM (0xFE) and APPn with n>=2: drop. */
        if (rp + 4 > len) break;
        uint16_t seg_len = ((uint16_t)buf[rp + 2] << 8) | buf[rp + 3];
        if (seg_len < 2 || rp + 2 + seg_len > len) {
            /* Malformed length — keep from here onwards verbatim so decoder
             * can still reach SOS if possible. */
            break;
        }
        bool drop = (m == 0xFE) || (m >= 0xE2 && m <= 0xEF);
        if (m == 0xDA /* SOS */) {
            /* After SOS comes compressed entropy data; stop filtering. */
            size_t remain = len - rp;
            if (wp != rp) memmove(buf + wp, buf + rp, remain);
            return wp + remain;
        }
        if (drop) {
            rp += 2 + seg_len;
        } else {
            size_t seg_total = 2 + seg_len;
            if (wp != rp) memmove(buf + wp, buf + rp, seg_total);
            wp += seg_total;
            rp += seg_total;
        }
    }
    /* Copy any remaining bytes verbatim. */
    size_t remain = len - rp;
    if (remain > 0) {
        if (wp != rp) memmove(buf + wp, buf + rp, remain);
        wp += remain;
    }
    return wp;
}

