betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
#if SOC_JPEG_DECODE_SUPPORTED
static bool cover_decode(const uint8_t *jpg, size_t len, int target_w, int target_h,
                          ha_cover_result_t *out)
{
    jpeg_decode_picture_info_t pic = {0};
    if (jpeg_decoder_get_info(jpg, len, &pic) != ESP_OK) {
        ESP_LOGW(TAG, "jpeg header parse failed");
        return false;
    }
    if (pic.width == 0 || pic.height == 0) return false;

    /* Decoder output dimensions must be a multiple of 16. The HW decoder does
     * not downscale: the output always has the source resolution (rounded up
     * to 16). We therefore allocate based on the actual picture size and only
     * reject images that would exceed a sane PSRAM budget. */
    uint32_t out_w = (pic.width + 15U) & ~15U;
    uint32_t out_h = (pic.height + 15U) & ~15U;
    (void)target_w;
    (void)target_h;

    /* Hard cap ~4 MB RGB565 (≈1440x1440). HA album art is typically ≤ 640²
     * which is ~0.8 MB. */
    const uint32_t MAX_PIXELS = 1440U * 1440U;
    if ((uint32_t)out_w * out_h > MAX_PIXELS) {
        ESP_LOGW(TAG, "jpeg %ux%u exceeds decode cap, skipping",
                 (unsigned)pic.width, (unsigned)pic.height);
        return false;
    }

    size_t rgb_size = (size_t)out_w * out_h * 2; /* RGB565 */
    jpeg_decode_memory_alloc_cfg_t mem_cfg = {
        .buffer_direction = JPEG_DEC_ALLOC_OUTPUT_BUFFER,
    };
    size_t allocated = 0;
    uint8_t *rgb = jpeg_alloc_decoder_mem(rgb_size, &mem_cfg, &allocated);
    if (rgb == NULL) {
        ESP_LOGW(TAG, "jpeg alloc output %u failed", (unsigned)rgb_size);
        return false;
    }

    /* LVGL 9 with LV_COLOR_FORMAT_RGB565 reads native little-endian 16-bit
     * words with R in the high 5 bits. The HW JPEG decoder writes the RGB
     * components MSB first when ELEMENT_ORDER_BGR is selected, which matches
     * LVGL's memory layout. Using RGB order here produces swapped colors
     * that look grainy/miscolored. */
    jpeg_decode_cfg_t dcfg = {
        .output_format = JPEG_DECODE_OUT_FORMAT_RGB565,
        .rgb_order = JPEG_DEC_RGB_ELEMENT_ORDER_BGR,
        .conv_std = JPEG_YUV_RGB_CONV_STD_BT601,
    };
    uint32_t produced = 0;
    esp_err_t err = jpeg_decoder_process(s_decoder, &dcfg, jpg, len, rgb, allocated, &produced);
    if (err != ESP_OK || produced == 0) {
        ESP_LOGW(TAG, "jpeg decode failed: %s", esp_err_to_name(err));
        heap_caps_free(rgb);
        return false;
    }

    out->image.header.magic = LV_IMAGE_HEADER_MAGIC;
    out->image.header.cf = LV_COLOR_FORMAT_RGB565;
    out->image.header.flags = 0;
    out->image.header.w = (uint32_t)out_w;
    out->image.header.h = (uint32_t)out_h;
    out->image.header.stride = (uint32_t)(out_w * 2);
    out->image.data_size = produced;
    out->image.data = rgb;
    out->source_w = pic.width;
    out->source_h = pic.height;

    /* Dominant color: coarse bucket histogram over a downsampled grid. */
    const int STEP = 8;
    uint32_t r_acc = 0, g_acc = 0, b_acc = 0, n = 0;
    const uint16_t *px = (const uint16_t *)rgb;
    for (uint32_t y = 0; y < out_h; y += STEP) {
        for (uint32_t x = 0; x < out_w; x += STEP) {
            uint16_t v = px[y * out_w + x];
            uint8_t r = (v >> 11) & 0x1F;
            uint8_t g = (v >> 5) & 0x3F;
            uint8_t b = v & 0x1F;
            /* Skip near-black and near-white pixels that would bias the mean
             * towards grey when the cover has a bold border. */
            int lum = r + g / 2 + b; /* rough luminance in 5-bit scale */
            if (lum < 4 || lum > 50) continue;
            r_acc += r;
            g_acc += g;
            b_acc += b;
            n++;
        }
    }
    uint32_t r8, g8, b8;
    if (n > 0) {
        r8 = (r_acc / n) * 255U / 31U;
        g8 = (g_acc / n) * 255U / 63U;
        b8 = (b_acc / n) * 255U / 31U;
    } else {
        r8 = 0x4D; g8 = 0xA3; b8 = 0xFF;
    }
    out->dominant_rgb = (r8 << 16) | (g8 << 8) | b8;
    out->valid = true;
    return true;
}
#else /* !SOC_JPEG_DECODE_SUPPORTED — software path via ROM TJpgDec */

/* TJpgDec session state. The decoder is created on demand for each cover
 * because TJpgDec is not designed for reuse across images. */
typedef struct {
    /* Input */
    const uint8_t *src;
    size_t src_len;
    size_t src_pos;
    /* Output */
    uint8_t *rgb565;       /* destination RGB565 buffer (LVGL native) */
    uint32_t out_w;        /* output buffer width  in pixels */
    uint32_t out_h;        /* output buffer height in pixels */
    /* Stats for dominant-color computation */
    uint32_t r_acc, g_acc, b_acc, n_acc;
} cover_sw_ctx_t;

static UINT cover_sw_in(JDEC *jd, BYTE *buf, UINT nb)
{
    cover_sw_ctx_t *ctx = (cover_sw_ctx_t *)jd->device;
    size_t remain = ctx->src_len - ctx->src_pos;
    if ((size_t)nb > remain) {
        nb = (UINT)remain;
    }
    if (buf != NULL && nb > 0) {
        memcpy(buf, ctx->src + ctx->src_pos, nb);
    }
    ctx->src_pos += nb;
    return nb;
}

/* TJpgDec ROM build outputs RGB888 (3 bytes/pixel). We convert each row to
 * RGB565 (LVGL native, little-endian) directly into the destination buffer. */
static UINT cover_sw_out(JDEC *jd, void *bitmap, JRECT *rect)
{
    cover_sw_ctx_t *ctx = (cover_sw_ctx_t *)jd->device;
    const uint8_t *src = (const uint8_t *)bitmap;
    const uint32_t rect_w = (uint32_t)(rect->right - rect->left + 1);
    const uint32_t rect_h = (uint32_t)(rect->bottom - rect->top + 1);

    for (uint32_t row = 0; row < rect_h; ++row) {
        const uint32_t y = (uint32_t)rect->top + row;
        if (y >= ctx->out_h) {
            break;
        }
        uint16_t *dst_row = (uint16_t *)(ctx->rgb565 + (size_t)y * ctx->out_w * 2);
        const uint8_t *src_row = src + (size_t)row * rect_w * 3;
        for (uint32_t col = 0; col < rect_w; ++col) {
            const uint32_t x = (uint32_t)rect->left + col;
            if (x >= ctx->out_w) {
                break;
            }
            uint8_t r = src_row[col * 3 + 0];
            uint8_t g = src_row[col * 3 + 1];
            uint8_t b = src_row[col * 3 + 2];
            dst_row[x] = (uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3));
            /* Sample every 8th pixel for the dominant-color histogram, with
             * the same near-black/near-white skip the HW path uses. */
            if (((x & 7U) == 0U) && ((y & 7U) == 0U)) {
                int lum = (r >> 3) + ((g >> 2) >> 1) + (b >> 3);
                if (lum >= 4 && lum <= 50) {
                    ctx->r_acc += r;
                    ctx->g_acc += g;
                    ctx->b_acc += b;
                    ctx->n_acc += 1;
                }
            }
        }
    }
    return 1; /* continue */
}

static uint8_t cover_sw_pick_scale(uint32_t src_w, uint32_t src_h,
                                    int target_w, int target_h)
{
    if (target_w <= 0 || target_h <= 0) return 0;
    /* TJpgDec supports 0=1/1, 1=1/2, 2=1/4, 3=1/8 */
    for (uint8_t s = 3; s > 0; --s) {
        uint32_t sw = src_w >> s;
        uint32_t sh = src_h >> s;
        if (sw >= (uint32_t)target_w && sh >= (uint32_t)target_h) {
            return s;
        }
    }
    return 0;
}

static bool cover_decode(const uint8_t *jpg, size_t len, int target_w, int target_h,
                          ha_cover_result_t *out)
{
    /* TJpgDec needs a scratch "pool" of ~3.5 KiB for its work tables. */
    enum { TJPGD_POOL_SZ = 3800 };
    void *pool = NULL;
#if defined(CONFIG_APP_PANEL_VARIANT_S3_480) && defined(CONFIG_SPIRAM) && CONFIG_SPIRAM
    pool = heap_caps_malloc(TJPGD_POOL_SZ, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
#endif
    if (pool == NULL) {
        pool = heap_caps_malloc(TJPGD_POOL_SZ, MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    }
    if (pool == NULL) {
        ESP_LOGW(TAG, "tjpgd pool alloc failed");
        return false;
    }

    cover_sw_ctx_t ctx = {0};
    ctx.src = jpg;
    ctx.src_len = len;

    JDEC jd;
    JRESULT jr = jd_prepare(&jd, cover_sw_in, pool, TJPGD_POOL_SZ, &ctx);
    if (jr != JDR_OK) {
        ESP_LOGW(TAG, "tjpgd jd_prepare failed: %d", (int)jr);
        heap_caps_free(pool);
        return false;
    }
    if (jd.width == 0 || jd.height == 0) {
        heap_caps_free(pool);
        return false;
    }

