betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
    uint8_t scale = cover_sw_pick_scale(jd.width, jd.height, target_w, target_h);
    uint32_t out_w = (uint32_t)jd.width >> scale;
    uint32_t out_h = (uint32_t)jd.height >> scale;
    if (out_w == 0 || out_h == 0) {
        heap_caps_free(pool);
        return false;
    }

    /* Hard cap ~4 MB RGB565 (≈1440x1440). */
    const uint32_t MAX_PIXELS = 1440U * 1440U;
    if ((uint32_t)out_w * out_h > MAX_PIXELS) {
        ESP_LOGW(TAG, "jpeg %ux%u (scale 1/%u) exceeds decode cap, skipping",
                 (unsigned)jd.width, (unsigned)jd.height, 1U << scale);
        heap_caps_free(pool);
        return false;
    }

    size_t rgb_size = (size_t)out_w * out_h * 2;
    uint8_t *rgb = heap_caps_malloc(rgb_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (rgb == NULL) {
        rgb = heap_caps_malloc(rgb_size, MALLOC_CAP_8BIT);
    }
    if (rgb == NULL) {
        ESP_LOGW(TAG, "tjpgd alloc output %u failed", (unsigned)rgb_size);
        heap_caps_free(pool);
        return false;
    }
    ctx.rgb565 = rgb;
    ctx.out_w = out_w;
    ctx.out_h = out_h;

    int64_t t0 = esp_timer_get_time();
    jr = jd_decomp(&jd, cover_sw_out, scale);
    heap_caps_free(pool);
    if (jr != JDR_OK) {
        ESP_LOGW(TAG, "tjpgd decode failed: %d", (int)jr);
        heap_caps_free(rgb);
        return false;
    }
    ESP_LOGD(TAG, "sw jpeg decoded %ux%u (scale 1/%u) in %lld ms",
             (unsigned)out_w, (unsigned)out_h, 1U << scale,
             (long long)((esp_timer_get_time() - t0) / 1000));

    out->image.header.magic = LV_IMAGE_HEADER_MAGIC;
    out->image.header.cf = LV_COLOR_FORMAT_RGB565;
    out->image.header.flags = 0;
    out->image.header.w = out_w;
    out->image.header.h = out_h;
    out->image.header.stride = out_w * 2;
    out->image.data_size = (uint32_t)rgb_size;
    out->image.data = rgb;
    out->source_w = jd.width;
    out->source_h = jd.height;

    if (ctx.n_acc > 0) {
        out->dominant_rgb = ((ctx.r_acc / ctx.n_acc) << 16) |
                            ((ctx.g_acc / ctx.n_acc) << 8) |
                            (ctx.b_acc / ctx.n_acc);
    } else {
        out->dominant_rgb = (0x4DU << 16) | (0xA3U << 8) | 0xFFU;
    }
    out->valid = true;
    return true;
}
#endif /* SOC_JPEG_DECODE_SUPPORTED */

/* ---- Worker task ---- */

static void cover_task(void *arg)
{
    (void)arg;
    for (;;) {
        cover_req_t req;
        if (xQueueReceive(s_queue, &req, portMAX_DELAY) != pdTRUE) continue;

        /* Mark as in-flight so cancel() can invalidate us. */
        xSemaphoreTake(s_lock, portMAX_DELAY);
        s_inflight = req;
        s_inflight_valid = true;
        void *cancelled = s_cancelled_user;
        xSemaphoreGive(s_lock);

        if (cancelled != NULL && cancelled == req.user) {
            xSemaphoreTake(s_lock, portMAX_DELAY);
            s_inflight_valid = false;
            s_cancelled_user = NULL;
            xSemaphoreGive(s_lock);
            continue;
        }

        /* 1) Wait for WS liveness, the heavy WS gate and a small internal
         *    heap/socket reserve. Cover fetches are nice-to-have UI work. */
        if (!cover_wait_until_http_ready(req.user)) {
            xSemaphoreTake(s_lock, portMAX_DELAY);
            if (cover_request_cancelled_locked(req.user)) {
                s_cancelled_user = NULL;
            }
            xSemaphoreGive(s_lock);
            xSemaphoreTake(s_lock, portMAX_DELAY);
            s_inflight_valid = false;
            xSemaphoreGive(s_lock);
            continue;
        }

        /* 2) Download with a few delayed retries for transient socket/TLS
         *    pressure. This avoids permanently losing the cover on one low
         *    internal-heap moment. */
        http_sink_t sink = {0};
        esp_err_t download_err = ESP_FAIL;
        bool ok = false;
        bool cancelled_download = false;
        for (uint8_t attempt = 0; attempt < COVER_HTTP_MAX_ATTEMPTS; attempt++) {
            if (!cover_wait_until_http_ready(req.user)) {
                xSemaphoreTake(s_lock, portMAX_DELAY);
                if (cover_request_cancelled_locked(req.user)) {
                    s_cancelled_user = NULL;
                }
                xSemaphoreGive(s_lock);
                cancelled_download = true;
                break;
            }

            download_err = cover_download(req.url, &sink);
            ha_client_set_aux_http_pressure(false, 0);
            if (download_err == ESP_OK) {
                ok = true;
                break;
            }

            if (sink.buf != NULL) {
                heap_caps_free(sink.buf);
                sink = (http_sink_t){0};
            }
            if (!cover_download_error_is_retryable(download_err) ||
                attempt + 1 >= COVER_HTTP_MAX_ATTEMPTS) {
                break;
            }

            uint32_t retry_ms = COVER_HTTP_RETRY_DELAY_MS * (uint32_t)(attempt + 1U);
            ESP_LOGI(TAG,
                "Cover HTTP retry %u/%u in %u ms after %s",
                (unsigned)(attempt + 2U),
                (unsigned)COVER_HTTP_MAX_ATTEMPTS,
                (unsigned)retry_ms,
                esp_err_to_name(download_err));
            if (!cover_delay_or_cancel(req.user, retry_ms)) {
                xSemaphoreTake(s_lock, portMAX_DELAY);
                if (cover_request_cancelled_locked(req.user)) {
                    s_cancelled_user = NULL;
                }
                xSemaphoreGive(s_lock);
                cancelled_download = true;
                break;
            }
        }
        ha_client_set_aux_http_pressure(false, 0);
        if (cancelled_download) {
            if (sink.buf != NULL) {
                heap_caps_free(sink.buf);
            }
            xSemaphoreTake(s_lock, portMAX_DELAY);
            s_inflight_valid = false;
            xSemaphoreGive(s_lock);
            continue;
        }

        /* 3) Decode + color */
        ha_cover_result_t result = {0};
        if (ok) {
            if (cover_is_png(sink.buf, sink.len)) {
                ok = cover_decode_png(sink.buf, sink.len, req.target_w, req.target_h, &result);
            } else {
                sink.len = cover_jpeg_sanitize(sink.buf, sink.len);
                ok = cover_decode(sink.buf, sink.len, req.target_w, req.target_h, &result);
            }
        }
        if (sink.buf) heap_caps_free(sink.buf);

        /* 4) Re-check cancellation, then dispatch on LVGL task. */
        xSemaphoreTake(s_lock, portMAX_DELAY);
        bool cancelled_final = (s_cancelled_user != NULL && s_cancelled_user == req.user);
        if (cancelled_final) s_cancelled_user = NULL;
        s_inflight_valid = false;
        xSemaphoreGive(s_lock);

