betamoojw/BETTA-HA-PANEL-4-Guiton-ESP32S3/main/ha/ha_cover_fetcher.c
        if (cancelled_final) {
            if (result.valid && result.image.data) heap_caps_free((void *)result.image.data);
            continue;
        }

        if (req.cb != NULL) {
            cover_dispatch_t *disp = (cover_dispatch_t *)cover_heap_calloc(1, sizeof(cover_dispatch_t));
            if (disp == NULL) {
                if (result.valid && result.image.data) heap_caps_free((void *)result.image.data);
                continue;
            }
            disp->result = result;
            disp->cb = req.cb;
            disp->user = req.user;
            if (lv_async_call(cover_dispatch_on_lvgl, disp) != LV_RESULT_OK) {
                if (result.valid && result.image.data) heap_caps_free((void *)result.image.data);
                heap_caps_free(disp);
            }
        } else if (result.valid && result.image.data) {
            heap_caps_free((void *)result.image.data);
        }
    }
}

static void cover_dispatch_on_lvgl(void *data)
{
    cover_dispatch_t *disp = (cover_dispatch_t *)data;
    if (disp == NULL) return;
    /* Final cancel check on the LVGL side – the consumer may have been
     * destroyed between enqueue and dispatch. */
    bool cancelled = false;
    xSemaphoreTake(s_lock, portMAX_DELAY);
    if (s_cancelled_user != NULL && s_cancelled_user == disp->user) {
        s_cancelled_user = NULL;
        cancelled = true;
    }
    xSemaphoreGive(s_lock);

    if (!cancelled) {
        disp->cb(disp->user, &disp->result);
    } else if (disp->result.valid && disp->result.image.data != NULL) {
        heap_caps_free((void *)disp->result.image.data);
    }
    /* If the callback did not keep the buffer, it must have called
     * ha_cover_result_release() which frees it. We cannot free here without
     * double-free risk; the contract is: callback owns the buffer. */
    heap_caps_free(disp);
}

/* ---- Public API ---- */

esp_err_t ha_cover_fetcher_init(void)
{
    if (s_task != NULL) return ESP_OK;
    s_lock = xSemaphoreCreateMutex();
    s_queue = xQueueCreate(COVER_Q_DEPTH, sizeof(cover_req_t));
    if (s_lock == NULL || s_queue == NULL) return ESP_ERR_NO_MEM;

#if SOC_JPEG_DECODE_SUPPORTED
    jpeg_decode_engine_cfg_t eng = {
        .intr_priority = 0,
        .timeout_ms = 2000,
    };
    if (jpeg_new_decoder_engine(&eng, &s_decoder) != ESP_OK) {
        ESP_LOGE(TAG, "jpeg_new_decoder_engine failed");
        return ESP_FAIL;
    }
#endif

    /* Low priority (below HA WS RX task). Run on core 1 to keep core 0
     * for the HA WS / LVGL path. */
    BaseType_t ok;
#if defined(CONFIG_APP_PANEL_VARIANT_S3_480) && CONFIG_SPIRAM && CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
    ok = xTaskCreatePinnedToCoreWithCaps(
        cover_task, "ha_cover", APP_HA_COVER_TASK_STACK, NULL, APP_HA_COVER_TASK_PRIO, &s_task, 1,
        MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
#else
    ok = xTaskCreatePinnedToCore(
        cover_task, "ha_cover", APP_HA_COVER_TASK_STACK, NULL, APP_HA_COVER_TASK_PRIO, &s_task, 1);
#endif
    if (ok != pdPASS) return ESP_FAIL;
    return ESP_OK;
}

esp_err_t ha_cover_fetcher_request(const char *entity_picture, int target_w, int target_h,
                                    ha_cover_cb_t cb, void *user)
{
    if (s_queue == NULL) return ESP_ERR_INVALID_STATE;
    if (entity_picture == NULL || entity_picture[0] == '\0' || cb == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (target_w < COVER_MIN_W) target_w = COVER_MIN_W;
    if (target_h < COVER_MIN_H) target_h = COVER_MIN_H;

    cover_req_t req = {0};
    snprintf(req.url, sizeof(req.url), "%s", entity_picture);
    req.target_w = target_w;
    req.target_h = target_h;
    req.cb = cb;
    req.user = user;

    /* Clear any stale cancel token for this consumer. After widget destroy the
     * heap may recycle the same ctx pointer for a freshly created widget; we
     * must not let the old cancel mark suppress legitimate new requests. */
    if (s_lock != NULL) {
        xSemaphoreTake(s_lock, portMAX_DELAY);
        if (s_cancelled_user == user) s_cancelled_user = NULL;
        xSemaphoreGive(s_lock);
    }

    if (xQueueSend(s_queue, &req, 0) != pdTRUE) {
        /* Drop-oldest policy: the newest entity_picture supersedes any stale
         * queued request for the same consumer anyway. */
        cover_req_t drop;
        (void)xQueueReceive(s_queue, &drop, 0);
        if (xQueueSend(s_queue, &req, 0) != pdTRUE) return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

void ha_cover_fetcher_cancel(void *user)
{
    if (s_lock == NULL) return;
    xSemaphoreTake(s_lock, portMAX_DELAY);
    s_cancelled_user = user;
    xSemaphoreGive(s_lock);
}

void ha_cover_result_release(ha_cover_result_t *result)
{
    if (result == NULL || !result->valid) return;
    if (result->image.data) {
        heap_caps_free((void *)result->image.data);
        result->image.data = NULL;
    }
    result->valid = false;
}
